Mod.org
*** CSS Token Emitter

This helper is responsible for actually walking the tree and emitting a complete collection of
tokens; formatting metadata as it finds it.

#+BEGIN_SRC js
function cssTokenEmitter(opts, head, node) {
  function assemble(head, node) {
    const { metadata, ...tokens } = node;
    return "".concat(
      (metadata && metadataEmitter(opts, metadata)) || "", // prepend metadata if defined
      Object.entries(tokens).reduce((str, [key, value]) => {
        const format = cssTokenAssembler(opts);
        if (typeof value === "object") {
          return str.concat(
            assemble(tokenStringIdentifier(head, key, "-"), value),
          );
        }

        return format(str, tokenStringIdentifier(head, key, "-"), value, "\n");
      }, ""),
    );
  }

  return assemble(head, node);
}
#+END_SRC

*** CSS Token Assembler

This helper is responsible for creating a string that the target format will actually recognize as a
variable or identifier.

#+BEGIN_SRC js
function cssTokenAssembler({
  padding = "",
  prefix = "--",
  assignment = ": ",
  suffix = ";",
  terminator = "\n",
}) {
  return function (str, key, value) {
    return str.concat(
      padding,
      prefix,
      key,
      assignment,
      value,
      suffix,
      terminator,
    );
  };
}
#+END_SRC

*** Token String Identifier

This helper is used when =*TokenEmitter= functions walk through the dictionary. It collects the
keys and joins them with a delimiter. However, it also /ignores/ any keys named base. Simply passing
through what it's already collected.

So =color.main.base= becomes =--color-main= in CSS for example.

#+BEGIN_SRC js
function tokenStringIdentifier(collected, current, delimiter) {
  return current === "base"
    ? collected
    : collected
    ? [collected, current].join(delimiter)
    : current;
}
#+END_SRC

*** Automatic Versioning

The following helper handles automatic versioning whenever project metadata defines =bump= as a
keyword other than ="manual"=.

#+BEGIN_SRC js
function bumpVersion(project) {
  let [major, minor, patch, pre] = Array.from(
    project.version.split(/[.-]/g),
  ).map((n) => parseFloat(n));

  function next(keyword) {
    const bumped = new Map([
      ["major", [major + 1, 0, 0]],
      ["minor", [major, minor + 1, 0]],
      ["patch", [major, minor, patch + 1]],
      ["pre", [major, minor, patch, pre + 1 || 0]],
      ["build", [major, minor, patch, pre, Date.now()]],
    ]).get(keyword);

    return bumped;
  }

  const releaseConditions = (release) =>
    Array.from(
      new Map([
        [release.length === 3, release.join(".")],
        [
          release.length === 4,
          [release.slice(0, 3).join("."), release[3]].join("-"),
        ],
        [
          release.length === 5,
          [
            release.slice(0, 3).join("."),
            [release[3] ?? 0, release[4]].join("+"),
          ].join("-"),
        ],
      ]),
    )
      .filter(([condition]) => condition)
      .flatMap(([, release]) => release)
      .toString();

  project["version"] = releaseConditions(next(project.bump));

  return project.version;
}
#+END_SRC

*** Timestamp Emitter

#+BEGIN_SRC js
function timestampEmitter() {
  const TIMESTAMP = new Date(Date.now());
  return `Updated on ${TIMESTAMP.toLocaleDateString()} at ${TIMESTAMP.toLocaleTimeString()}`;
}
#+END_SRC

*** YAML Assemblers

The following helpers format YAML by the three main structures of the Quarks System Dictionary
schema: values, scales, and subcategories. The value function helpfully handles the multiline
metadata strings as well.

#+BEGIN_SRC js
function yamlDictSubcategory(level, data) {
  return Object.entries(data).reduce((str, [key, v]) => {
    if (Array.isArray(v)) return yamlDictScale(level, str, key, v);
    return yamlDictValue(level, str, key, v);
  }, "");
}

function yamlDictValue(level, str, key, value) {
  const isMultiline = value.split("\n").length > 1;
  if (isMultiline) {
    return str.concat(
      "".padStart(level),
      `${key}: |\n`,
      value
        .split("\n")
        .reduce((s, line) => s.concat("".padStart(level + 2), line, "\n"), ""),
    );
  }
  return str.concat("".padStart(level), key, ": ", value, "\n");
}

function yamlDictScale(level, str, key, value) {
  return str.concat(
    "".padStart(level),
    key,
    ":\n",
    value.reduce((s, v) => s.concat("".padStart(level + 2), "- ", v, "\n"), ""),
  );
}
#+END_SRC

* Utilities
:PROPERTIES:
:header-args:js: :tangle "./utilities.js" :comments link
:END:
* Internals
** Functional Programming
:PROPERTIES:
:header-args:js: :tangle "./lib/utilities/fp.js" :comments link
:END:
My first set of internals are used throughout the codebase and contribute to its
composable and expressive design.

*** Currying

Currying is a powerful higher-order transformation where a function of =n= arguments is morphed into
a sequence of calls with one argument. So this: =fn(z, y, x)= becomes =fn(z)(y)(x)=.

This utility really shines in a data-last architectures like this project. Since the final argument
is /always/ data, currying allows you to preload its modifiers and leave the data operation =fn(x)=
for composition and pipelining.

The implementation is an advanced curry that allows partial application and uncurried functionality.

#+BEGIN_SRC js
export function curry(fn) {
  return (...initial) =>
    initial.length >= fn.length
      ? fn.apply(this, initial)
      : (...remaining) => fn.apply(this, initial.concat(remaining));
}
#+END_SRC

*** Composition

Functional composition is a higher-order operation that combines functions in sequence into a brand
new function queued for data. It's an excellent way to reuse tiny utilities for more complex
behavior.

Currying and composition are the chocolate and caramel of Quarks System Core.

#+BEGIN_SRC js
export function compose(...fns) {
  return (x) => fns.reduce((g, f) => f(g), x);
}
#+END_SRC

*** Pipelining

Pipelining is a powerful pattern that drives this project, because its main purpose is to generate
and manipulate data. Excepting the error handlers and formatters, data is *both the input and output*
of every function.

As the name implies, pipelining is a higher-order function where data is transformed by being piped
through a series of data operations. These operations can themselves include compositions and
pipelines.

Another way to think of it: composition combines data /operations/, pipelining applies data
/transformations/.

#+BEGIN_SRC js
export function pipe(x, ...fns) {
  return compose(...fns)(x);
}
#+END_SRC

** Color

The beefiest slab of code in Quarks System Core is by far the internal color library. This is
because color science is hard, I'm a little obsessive, and I wanted to get it as correct as I
possibly could.

*** Converter
:PROPERTIES:
:header-args:js: :tangle "./lib/utilities/color/converter/index.js" :comments link
:END:

#+BEGIN_SRC js
import { compose, pipe } from "../../fp.js";
import { validator } from "../validator/index.js";
import {
  cielabToRgb,
  cmykToRgb,
  hexToRgb,
  hslToRgb,
  hwbToRgb,
  oklabToRgb,
} from "./color_to_rgb.js";
import {
  cielabFromRgb,
  cmykFromRgb,
  hexFromRgb,
  hslFromRgb,
  hwbFromRgb,
  oklabFromRgb,
} from "./color_from_rgb.js";
import {
  cielabFromCielch,
  cielabToCielch,
  hexFromNamedColor,
} from "./linkers.js";
#+END_SRC

#+BEGIN_SRC js
const INPUT_TO_RGB = {
  named: compose(hexFromNamedColor, passthrough, hexToRgb),
  hex: hexToRgb,
  rgb: compose(hexFromRgb, passthrough, hexToRgb), // identity
  hsl: hslToRgb,
  cmyk: cmykToRgb,
  hwb: hwbToRgb,
  cielab: cielabToRgb,
  cielch: compose(cielabFromCielch, passthrough, cielabToRgb),
  oklab: oklabToRgb,
};

const OUTPUT_FROM_RGB = {
  hex: hexFromRgb,
  rgb: compose(hexFromRgb, passthrough, hexToRgb),
  hsl: hslFromRgb,
  cmyk: cmykFromRgb,
  hwb: hwbFromRgb,
  cielab: cielabFromRgb,
  cielch: compose(cielabFromRgb, passthrough, cielabToCielch),
  oklab: oklabFromRgb,
};

function passthrough([, color]) {
  return color;
}

export function convert(output, color) {
  const [input, value] = validator(color);
  return pipe(
    validator(color),
    ([input, color]) => INPUT_TO_RGB[input](color),
    ([, color]) => OUTPUT_FROM_RGB[output](color),
  );
}
#+END_SRC

**** Color to RGB
:PROPERTIES:
:header-args:js: :tangle "./lib/utilities/color/converter/color_to_rgb.js" :comments link
:END:

#+BEGIN_SRC js
import { curry, pipe } from "../../fp.js";
import { validator } from "../validator/index.js";
import { output, parser } from "../parser/index.js";
import { normalize, numberToRgb } from "./math.js";
#+END_SRC

***** Hex to RGB

#+BEGIN_SRC js
export function hexToRgb(color) {
  const [, components] = parser(color);
  return pipe(output(["rgb", components]), validator);
}
#+END_SRC

