lib/utilities/color/converter/color_to_rgb.js
// [[file:../../../../Mod.org::*Color to RGB][Color to RGB:1]]
import { curry, pipe } from "../../fp.js";
import { validator } from "../validator/index.js";
import { output, parser } from "../parser/index.js";
import { normalize, numberToRgb } from "./math.js";
// Color to RGB:1 ends here

// [[file:../../../../Mod.org::*Hex to RGB][Hex to RGB:1]]
export function hexToRgb(color) {
  const [, components] = parser(color);
  return pipe(output(["rgb", components]), validator);
}
// Hex to RGB:1 ends here
