Mod.org
***** HWB from RGB

#+BEGIN_SRC js
export function hwbFromRgb(color) {
  const [, [R, G, B, A]] = parser(color);

  const MAX = Math.max(R, G, B);
  const MIN = Math.min(R, G, B);
  const DELTA = MAX - MIN;

  const [H] = Array.from(calculateHue(R, G, B, MAX, DELTA))
    .filter(([, condition]) => condition)
    .flatMap(([result]) => result);

  const [W, BLK] = [MIN, 1 - MAX];

  const limitPercent = curry(normalize)(100, 0);

  return pipe(
    output([
      "hwb",
      [
        hueCorrection(H),
        ...[W, BLK].map((V) =>
          pipe(V, numberToPercent, limitPercent).toString().concat("%")
        ),
        A,
      ],
    ]),
    validator,
  );
}
#+END_SRC

***** CIELAB from RGB

#+BEGIN_SRC js
export function cielabFromRgb(color) {
  const [, [R, G, B, A]] = parser(color);
  const [X, Y, Z] = rgbToCieXYZ([R, G, B]);
  const [L, a, b] = ciexyzToCielab([X, Y, Z]);

  return pipe(
    output(["cielab", [L.toString().concat("%"), a, b, A]]),
    validator,
  );
}

function ciexyzToCielab([X, Y, Z]) {
  // CIE standards
  const ε = 216 / 24389;
  const κ = 24389 / 27;
  const D50_WHITE = [0.96422, 1.0, 0.82521];

  // Calculating F for each value
  const [FX, FY, FZ] = [X, Y, Z]
    .map((V, i) => V / D50_WHITE[i])
    .map((V) => (V > ε ? Math.cbrt(V) : (κ * V + 16) / 116));

  const [L, a, b] = [116 * FY - 16, 500 * (FX - FY), 200 * (FY - FZ)]
    .map((V) => precision(V))
    .map((V, pos) =>
      pos === 0 ? normalize(256, 0, V) : +normalize(128, -127, V).toFixed(4)
    );

  return [L, a, b];
}

const D65_REFERENCE_WHITE = [
  [0.4124564, 0.3575761, 0.1804375],
  [0.2126729, 0.7151522, 0.072175],
  [0.0193339, 0.119192, 0.9503041],
];

const D50_CHROMATIC_ADAPTATION = [
  [1.0478112, 0.0228866, -0.050127],
  [0.0295424, 0.9904844, -0.0170491],
  [-0.0092345, 0.0150436, 0.7521316],
];

function rgbToCieXYZ([R, G, B]) {
  const [LR, LG, LB] = rgbToLinearRGB([R, G, B]);

  const [x, y, z] = D65_REFERENCE_WHITE.map(
    ([V1, V2, V3]) => LR * V1 + LG * V2 + LB * V3,
  );

  const [X, Y, Z] = D50_CHROMATIC_ADAPTATION.map(
    ([V1, V2, V3]) => x * V1 + y * V2 + z * V3,
  );

  return [X, Y, Z];
}

function rgbToLinearRGB([R, G, B]) {
  return [R, G, B].map((V) =>
    V <= 0.04045 ? V / 12.92 : ((V + 0.055) / 1.055) ** 2.4
  );
}
#+END_SRC

***** Oklab from RGB

#+BEGIN_SRC js
export function oklabFromRgb(color) {
  const [, [R, G, B, A]] = parser(color);
  const [l, a, b] = linearRGBToOklab([R, G, B]);

  const L = numberToPercent(l).toString().concat("%");
  const c = normalize(0.5, 0, +Math.sqrt(a ** 2 + b ** 2).toFixed(4)); // toPrecision isn't strict enough
  const C = Math.sign(Math.round(c)) === -1 ? 0 : c;
  const H = pipe(Math.atan2(b, a), radToDegrees, hueCorrection);

  return pipe(output(["oklab", [L, C, H, A]]), validator);
}

const NONLINEAR_LMS_CONE_ACTIVATIONS = [
  [0.4122214708, 0.5363325363, 0.0514459929],
  [0.2119034982, 0.6806995451, 0.1073969566],
  [0.0883024619, 0.2817188376, 0.6299787005],
];

const RGB_OKLAB_MATRIX = [
  [0.2104542553, 0.793617785, 0.0040720468],
  [1.9779984951, 2.428592205, 0.4505937099],
  [0.0259040371, 0.7827717662, 0.808675766],
];

function linearRGBToOklab([R, G, B]) {
  const [LR, LG, LB] = rgbToLinearRGB([R, G, B]);

  const [L, M, S] = NONLINEAR_LMS_CONE_ACTIVATIONS.map(
    ([L, M, S]) => L * LR + M * LG + S * LB,
  ).map((V) => Math.cbrt(V));

  return RGB_OKLAB_MATRIX.map(([V1, V2, V3], pos) => {
    if (pos === 0) return V1 * L + V2 * M - V3 * S;
    if (pos === 1) return V1 * L - V2 * M + V3 * S;
    return V1 * L + V2 * M - V3 * S;
  });
}
#+END_SRC

**** Linkers
:PROPERTIES:
:header-args:js: :tangle "./lib/utilities/color/converter/linkers.js" :comments link
:END:

#+BEGIN_SRC js
import { NAMED_COLOR_KEYWORDS } from "../../../data.js";
import { pipe } from "../../fp.js";
import { validator } from "../validator/index.js";
import { output, parser } from "../parser/index.js";
import {
  hueCorrection,
  normalize,
  radFromDegrees,
  radToDegrees,
} from "./math.js";
#+END_SRC

***** Named Color to Hex

#+BEGIN_SRC js
export function hexFromNamedColor(color) {
  return validator(NAMED_COLOR_KEYWORDS[color]);
}
#+END_SRC

***** CIELAB to CIELCh(ab)

#+BEGIN_SRC js
export function cielabToCielch(color) {
  const [, [L, a, b, A]] = parser(color);

  const C = normalize(132, 0, Math.sqrt(a ** 2 + b ** 2));
  const H = pipe(Math.atan2(b, a), radToDegrees, hueCorrection);

  return pipe(
    output(["cielch", [L.toString().concat("%"), C, H, A]]),
    validator,
  );
}
#+END_SRC

***** CIELCh(ab) to CIELAB

#+BEGIN_SRC js
export function cielabFromCielch(color) {
  const [, [L, C, H, A]] = parser(color);

  const [a, b] = [
    C * Math.cos(radFromDegrees(H)),
    C * Math.sin(radFromDegrees(H)),
  ].map((V) => normalize(128, -127, V));

  return pipe(
    output(["cielab", [L.toString().concat("%"), a, b, A]]),
    validator,
  );
}
#+END_SRC

**** Math
:PROPERTIES:
:header-args:js: :tangle "./lib/utilities/color/converter/math.js" :comments link
:END:

#+BEGIN_SRC js
import { compose } from "../../fp.js";
#+END_SRC

***** Arithmetic

#+BEGIN_SRC js
const add = (y, x) => x + y;
const multiply = (y, x) => x * y;
const divide = (y, x) => x / y;
const remainder = (y, x) => x % y;
#+END_SRC

***** Limiters

#+BEGIN_SRC js
export const precision = (value) => +value.toPrecision(5);
export const normalize = (b, a, x) => (x < a ? a : x > b ? b : precision(x));
#+END_SRC

***** Hexadecimal

#+BEGIN_SRC js
export const hexFragmentToRgb = (fragment) => parseInt(fragment, 16);
export const hexFragmentFromRgb = (channel) =>
  channel.toString(16).padStart(2, "0");
#+END_SRC

***** Percent Calculations

#+BEGIN_SRC js
export const numberToPercent = (n) => multiply(100, n);
export const numberFromPercent = (percentage) => divide(100, percentage);
#+END_SRC

***** RGB Component Calculations

#+BEGIN_SRC js
export const numberToRgb = (n) => multiply(255, n);
export const numberFromRgb = (channel) => divide(255, channel);
export const rgbFromPercent = compose(
  numberFromPercent,
  numberToRgb,
  Math.round,
);
export const hexFragmentFromNumber = compose(
  numberToRgb,
  Math.round,
  hexFragmentFromRgb,
);
#+END_SRC

***** Hue Calculations

#+BEGIN_SRC js
export const radToDegrees = (radians) =>
  compose(
    () => divide(Math.PI, 180),
    (result) => multiply(result, radians),
    (degrees) => precision(degrees),
  )();
export const radFromDegrees = (degrees) =>
  compose(
    () => divide(180, Math.PI),
    (result) => multiply(result, degrees),
    (radians) => precision(radians),
  )();
export const gradToDegrees = (gradians) =>
  compose(
    () => divide(200, 180),
    (result) => multiply(result, gradians),
    (degrees) => precision(degrees),
  )();
export const numberToDegrees = (n) => multiply(360, n);
export const hueCorrection = (hue) =>
  normalize(
    360,
    -360,
    Math.sign(hue) === -1 ? Math.abs(add(360, hue)) : hue > 360
      ? remainder(360, hue)
      : hue,
  );
#+END_SRC

