Mod.org
*** Validator
:PROPERTIES:
:header-args:js: :tangle "./lib/utilities/color/validator/index.js" :comments link
:END:

#+BEGIN_SRC js
import { QSCError } from "../../../error.js";
#+END_SRC

Before a color can be converted, we must be sure it's in fact a color.

#+BEGIN_SRC js
const SUPPORTED_FORMATS = {
  named: namedValidator,
  hex: hexValidator,
  rgb: rgbValidator,
  hsl: hslValidator,
  cmyk: cmykValidator,
  hwb: hwbValidator,
  cielab: cielabValidator,
  cielch: cielchValidator,
  oklab: oklabValidator,
};

export function validator(color) {
  return (
    Object.entries(SUPPORTED_FORMATS)
      .map(([format, fn]) => [format, fn(color) && color])
      .find(([, color]) => color) || InvalidOrUnsupportedColorError()
  );
}

function InvalidOrUnsupportedColorError() {
  throw new QSCError({
    name: "Invalid or Unsupported Color",
    reason: `
The input matches none of Quarks System Core's supported color formats. It's
also possible you have a syntax error.
`,
    suggestion: `
Check your input color against these supported CSS color formats:

Named Colors
------------
coral
springgreen
dodgerblue
rebeccapurple

RGB Hex
-------
#f0f
#ca5e
#933cca
#99eefff7

Functional RGB
--------------
rgb(30, 110, 0)
rgb(19%, 38.9%, 70%)
rgba(255, 255, 255, 0.8)
rgb(129 22 108)
rgb(20% 2% 100% / 0.25)

Functional HSL
--------------
hsl(240, 39%, 81%)
hsla(120, 78%, 45%, 0.93)
hsl(2.5rad 29% 40%)
hsl(216.44grad 20% 90% / 0.75)

Device CMYK
-----------
device-cmyk(0 0.2 0.399 0)
device-cmyk(90% 0% 0% 37.5%)
device-cmyk(0% 39% 0% 0 / 0.88)

HWB
---
hwb(60 83% 0%)
hwb(90 0% 37%)
hwb(0.75turn 30% 25%)
hwb(300 29% 5% / 0.99)

CIELAB
------
lab(48% 101 -39)
lab(87% -33 0)
lab(59% -88 -2 / 0.5)

CIELCh(ab)
----------
lch(25% 49 180)
lch(75% 0 0)
lch(56.551 77.38 2rad / 0.6892)

Oklab (LCh)
-----------
NOTE: This format is non-standard. If you use it, be sure to
convert to a standard CSS format. Example: hex("oklab(0% 0 0)")

oklab(59.4% 0.33 150)
oklab(33% 64% 0.2turn)
oklab(68.332% 0.16 1.778rad)
`,
  });
}
#+END_SRC

**** Syntax Tokens

***** Primitives

#+BEGIN_SRC js
const NUMBER_TOKEN = /(?:-?(?!0\d)\d+(?:\.\d+)?)/;
const PERCENT_TOKEN = new RegExp(["(?:", NUMBER_TOKEN.source, "%)"].join(""));
#+END_SRC

***** Delimiters

#+BEGIN_SRC js
const DELIMITER = /(?:[\s,]+)/;
const ALPHA_DELIMITER = new RegExp(DELIMITER.source.replace(",", ",/"));
const CSS4_DELIMITER = new RegExp(DELIMITER.source.replace(",", ""));
const CSS4_ALPHA_DELIMITER = new RegExp(
  ALPHA_DELIMITER.source.replace(",", ""),
);
#+END_SRC

***** Components

#+BEGIN_SRC js
const COMPONENT_TOKEN = new RegExp(
  ["(?:", PERCENT_TOKEN.source, "|", NUMBER_TOKEN.source, ")"].join(""),
);
const HUE_TOKEN = new RegExp(
  ["(?:", NUMBER_TOKEN.source, "(?:deg|g?rad|turn)?)"].join(""),
);
#+END_SRC

**** Named Color Validator

#+BEGIN_SRC js
function namedValidator(color) {
  return !!NAMED_COLORS[color];
}
#+END_SRC

**** Hex Validator

#+BEGIN_SRC js
function hexValidator(color) {
  return /^#([\da-f]{3,4}){1,2}$/i.test(color);
}
#+END_SRC

**** RGB Validator

#+BEGIN_SRC js
function rgbValidator(color) {
  return matchFunctionalFormat(
    { prefix: "rgba?" },
    Array(3).fill(COMPONENT_TOKEN),
  ).test(color);
}
#+END_SRC

**** HSL Validator

#+BEGIN_SRC js
function hslValidator(color) {
  return matchFunctionalFormat({ prefix: "hsla?" }, [
    HUE_TOKEN,
    ...Array(2).fill(PERCENT_TOKEN),
  ]).test(color);
}
#+END_SRC

**** CMYK Validator

#+BEGIN_SRC js
function cmykValidator(color) {
  return matchFunctionalFormat(
    { prefix: "device-cmyk", legacy: false },
    Array(4).fill(COMPONENT_TOKEN),
  ).test(color);
}
#+END_SRC

**** HWB Validator

#+BEGIN_SRC js
function hwbValidator(color) {
  return matchFunctionalFormat({ prefix: "hwb", legacy: false }, [
    HUE_TOKEN,
    ...Array(2).fill(PERCENT_TOKEN),
  ]).test(color);
}
#+END_SRC

**** CIELAB Validator

#+BEGIN_SRC js
function cielabValidator(color) {
  return matchFunctionalFormat({ prefix: "lab", legacy: false }, [
    PERCENT_TOKEN,
    ...Array(2).fill(NUMBER_TOKEN),
  ]).test(color);
}
#+END_SRC

**** CIELCh(ab) Validator

#+BEGIN_SRC js
function cielchValidator(color) {
  return matchFunctionalFormat({ prefix: "lch", legacy: false }, [
    PERCENT_TOKEN,
    NUMBER_TOKEN,
    HUE_TOKEN,
  ]).test(color);
}
#+END_SRC

**** Oklab Validator

#+BEGIN_SRC js
function oklabValidator(color) {
  return matchFunctionalFormat({ prefix: "oklab", legacy: false }, [
    PERCENT_TOKEN,
    COMPONENT_TOKEN,
    HUE_TOKEN,
  ]).test(color);
}
#+END_SRC

**** Functional Formats

#+BEGIN_SRC js
function matchFunctionalFormat({ prefix, legacy = true }, tokens) {
  const VALUES = tokens.map((token) => token.source);

  const SEPARATOR = legacy ? DELIMITER.source : CSS4_DELIMITER.source;
  const ALPHA_SEPARATOR = legacy
    ? ALPHA_DELIMITER.source
    : CSS4_ALPHA_DELIMITER.source;

  return new RegExp(
    `(?:^${prefix}\\(`.concat(
      VALUES.join(SEPARATOR),
      `(?:${[ALPHA_SEPARATOR, COMPONENT_TOKEN.source].join("")})?\\))`,
    ),
  );
}
#+END_SRC

*** Extractor
:PROPERTIES:
:header-args:js: :tangle "./lib/utilities/color/extractor/index.js" :comments link
:END:

#+BEGIN_SRC js
import { compose } from "../../fp.js";
import { validator } from "../validator/index.js";
#+END_SRC

Once we're sure have a valid color, we need to extract its components.

#+BEGIN_SRC js
export const extractor = compose(validator, ([format, color]) => [
  format,
  format === "hex" ? hexExtractor(color) : componentExtractor(color),
]);
#+END_SRC

**** Hex Extractor

#+BEGIN_SRC js
function hexExtractor(color) {
  return expandHex(color).match(/[\da-f]{2}/gi);
}

function expandHex(color) {
  const [, ...values] = color;

  if (values.length === 3 || values.length === 4) {
    return `#${values.map((channel) => channel.repeat(2)).join("")}`;
  }

  return color;
}
#+END_SRC

**** Component Extractor

#+BEGIN_SRC js
function componentExtractor(color) {
  return color.match(/(-?[\d.](%|deg|g?rad|turn)?)+/g);
}
#+END_SRC

*** Parser
:PROPERTIES:
:header-args:js: :tangle "./lib/utilities/color/parser/index.js" :comments link
:END:

#+BEGIN_SRC js
import { compose, pipe } from "../../fp.js";
import { validator } from "../validator/index.js";
import { extractor } from "../extractor/index.js";
import {
  gradToDegrees,
  hexFragmentToRgb,
  hueCorrection,
  numberFromPercent,
  numberFromRgb,
  numberToDegrees,
  precision,
  radFromDegrees,
  radToDegrees,
} from "../converter/math.js";
#+END_SRC

Finally, before the conversion math, we need to parse the extracted components to raw values as
determined by the color conversion formulas below.

#+BEGIN_SRC js
const FORMAT_PARSERS = {
  hex: parseHex,
  rgb: parseRGB,
  hsl: parseHSL,
  cmyk: parseCMYK,
  hwb: parseHSL, // identical to HSL
  cielab: parseCielab,
  cielch: parseCielch,
  oklab: parseOklab,
};

export const parser = compose(
  validator,
  ([format, color]) => FORMAT_PARSERS[format](color),
);
#+END_SRC

**** Format Parsers

***** Hex Parser

#+BEGIN_SRC js
function parseHex(color) {
  return pipe(
    extractor(color),
    ([format, components]) => [
      format,
      components.length === 4 ? components : [...components, "ff"],
    ],
    ([format, components]) => [
      format,
      components.map((c, pos) =>
        pos === 3
          ? pipe(c, hexFragmentToRgb, numberFromRgb)
          : hexFragmentToRgb(c)
      ),
    ],
  );
}
#+END_SRC

***** RGB Parser

#+BEGIN_SRC js
function parseRGB(color) {
  return pipe(
    extractor(color),
    ([format, components]) => [
      format,
      components.length === 4 ? components : [...components, "1"],
    ],
    ([format, components]) => [
      format,
      components.map((c, pos) =>
        c.endsWith("%")
          ? parsePercent(c)
          : pos === 3
          ? parseNumber(c)
          : parseChannel(c)
      ),
    ],
  );
}
#+END_SRC

***** HSL Parser

#+BEGIN_SRC js
function parseHSL(color) {
  return pipe(
    extractor(color),
    ([format, components]) => [
      format,
      components.length === 4 ? components : [...components, "1"],
    ],
    ([format, components]) => [
      format,
      components.map((c, pos) =>
        pos === 0
          ? parseHue(c)
          : pos === 3
          ? c.endsWith("%") ? parsePercent(c) : parseNumber(c)
          : parsePercent(c)
      ),
    ],
  );
}
#+END_SRC

***** CMYK Parser

#+BEGIN_SRC js
function parseCMYK(color) {
  return pipe(
    extractor(color),
    ([format, components]) => [
      format,
      components.length === 5 ? components : [...components, "1"],
    ],
    ([format, components]) => [
      format,
      components.map((c) => c.endsWith("%") ? parsePercent(c) : parseNumber(c)),
    ],
  );
}
#+END_SRC

***** CIELAB Parser

#+BEGIN_SRC js
function parseCielab(color) {
  return parseCie((ab) => parseNumber(ab), color);
}
#+END_SRC

***** CIELCh(ab) Parser

#+BEGIN_SRC js
function parseCielch(color) {
  return parseCie(
    (c, pos) => (pos === 2 ? parseHue(c) : parseNumber(c)),
    color,
  );
}
#+END_SRC

